const noteData = {
  "note01": {
    title: "깨달음과 형태",
    date: "2023.12",
    body: `사라진다는 사실만 있고,
    무엇이 사라지는지, 어디로 사라지는지.
    잊어버린건지도, 잃어버린건지조차 모른 채,
    인생의 절반은 산 듯했다.

    12월.
    하늘에서 쏟아지듯 눈이 내리고,
    모든 세상이 멈춰버린 어느 겨울밤.
    허공을 올려다보며 생각했다.
    
    나는 어디에 있었을까. 
    
    겨울의 한 가운데. 
    계속 늙어가는 나에게 실바람처럼 오랜 기억들이 말을 걸어왔다. 
    까만 밤마다 눈을 감고 있으면, 뭉게뭉게 피어오르고 아득히 멀리 퍼지는 이미지. 
    주파수를 타고 조금씩 선명해지는 소리들과 손끝에 닿을 듯 가까운 감촉들.
    파노라마처럼 펼쳐지는 인생의 스냅샷. 

    가령 이런것들이었다.

    우유 냄새가 나는 아기의 볼과 뒤통수. 
    몸이 잠길 정도로 흙을 푸던 아이의 손톱.
    다락에 숨어 정오의 빛을 몰래 훔쳐보던 어린이의 사춘기.
    주차장을 놀이공원처럼 휘젓고 놀던 친구들과의 숨바꼭질.
    등을 굽히고 무릎을 꿇을 때마다 둔탁한 소리를 내는 아버지의 뒷모습. 
    우산을 두 개 들고 저 멀리서 걸어오는 엄마의 실루엣. 
    모든 틈새마다 쪼그리고 구경하던 동생의 집중.
    눈물을 머금은 채 웃고 있던 할머니의 주름진 얼굴. 
    허수경 시인의 마지막 시.
    서태지 7번째 앨범의 열번째 트랙.
    독일식 사고를 하는 어느 건축가의 스케치. 
    방과 빛과 질서와 형태를 논하던 철학자의 문장들.

    나를, 다시 나를 통해 꺼내는 일. 
    그런 것이 하고 싶어졌다. 

    내가 느끼고 간직하고 응원하고 목격한 삶의 조각들을 조심히 모아,
    별을 찾아 별자리를 잇고 별천지를 새기고 싶은 마음으로 손수 지었다. 
    
    존재하려고 애쓰는 마음이 없어질 때까지,
    나아갈 때는 나아가고, 
    멈춰야만 할때 멈추는 연습을 반복하며
    진솔하게 빚었다.




    
  `,
  },


  "note02": {
    title: "사람의 얼굴",
    date: "2024.02",
    body: `눈을 감은 사람을 보면 얼굴이 더 잘 보인다. 
눈가도 잘 보이고, 코도 잘 보이고, 입도 잘 보인다. 
뺨도, 귀도, 이마도 보인다. 
빛도 그림자도, 주름도 살결도 보인다.
그리고 무엇보다 얼굴 너머의 얼굴도 보인다.  
설명은 잘 되지 않는다. 
헤아릴 수도 없는 것 같다. 

나는 원래 타인의 눈을 제대로 쳐다보지 못했다. 
눈이 마주치면 피했다.
아주 조금씩 흔들리는 검은 눈동자를 보면 나의 전체가 흔들렸다. 
두려워하는 사람의 하얀 눈자위를 보면 나도 두려웠다. 
가까이에서 화가 밀려오는 사람의 변해가는 눈을 무서워했다. 
눈알이 붙어 있는 인형이나 안내 표식을 위한 눈동자 사인에도 몰래 눈치를 봤다. 
지하철에서 나와 눈이 마주친 외국인의 미소를 따라 웃어보였던 무렵부터 컴플렉스는 작은 금이 가기 시작한 것 같다.
역사시간에 어느 소설 이야기를 하는 담임선생님으로부터 눈빛이란 걸 알게 되었고,
나를 뚫어지게 쳐다보던 강아지가 배를 보여주었을 때 어느 정도 허물어졌으며,
좋아하는 여자아이가 나도 너를 좋아한다고 말해주었을 때 컴플렉스는 치유된 것 같았다. 

하지만 타인의 눈동자가 어디까지 보고있는지를 가늠할 수 있을 나이가 되어서부터는 다시 두려움이 몰려왔다. 
보고싶은 대로 보고, 보기 싫은 것도 봐야하는 타인의 눈 속을 내 눈으로 보는 일이 괴로울 때가 간혹 생겼다.
상투적인 것들로부터 벗어나고 싶어 눈을 가리어도 마음속엔 이미 속된 눈들이 부릅 떠있기도 했다. 

나는 눈을 극복할 수 없었고, 때때로 미워했다.

하지만.
그럼에도 불구하고.
나는 얼굴에게 위로받았다. 

어릴 적 엄마가 아직 자고 있을 때면, 콧구멍 앞에 손가락을 대고 숨을 쉬고 있는 확인하면서 엄마 얼굴을 가만히 관찰했다. 
할머니 방에 누워 실실거리고 있으면 항상 할머니가 머리를 대고 눕는 자리 근처에 놓여있던 성모마리아상을 지그시 쳐다보곤 했다.  
가족들과 여행하다 우연히 절에 들렀을 때 노오란 부처님의 얼굴 주위를 한참 기웃거렸다.  
잠이 든 숙모의 아가 손바닥에 내 손가락을 올려놓고 오래토록 눈썹이며, 볼이며, 머리카락을 살폈다. 

나는 두 눈을 감은 얼굴 앞에서 다정했다.  





인생의 많은 시간, 눈을 감고 있다.
눈을 감고 잠을 자고,
눈을 감고 기도를 하기도 한다.
고통을 참을 때 눈을 감는다. 
울거나 웃을 때 눈을 감는다. 
그리고 눈을 감은 채로 태어나 눈을 감은 채로 죽는다. 
편하게. 순하게.

얼굴은 말보다 앞서고, 눈보다 정직하다.
어쩌면 얼굴은 자기 자신보다 더 오래 남는 것 같다. 
침묵의 기척과 소모된 시간들이 그 위에 천천히 내려앉는다. 


나는 얼굴을 찾는다. 
자그마한 기억들을 모으고 주워서
하나의 얼굴에 도착할 때까지.





    `,
  },




  
  "note03": {
    title: "concretely",
    date: "2024.05",
    body: `시인이 시를 남기듯이 
나무가 씨앗을 뿌리듯이
어버이가 자식을 낳듯이
나도 무언가를 남기고 싶었다
나보다 더 남는 것으로 남기고 싶었다. 



콘크리트.

콘크리트는 콘크리트라는 이름부터 좋다.
발음할 때, 탁음 사이 부드럽게 미끄러지는 발음으로 완성되는 단어가 그 성질과 닮았다.  
일종의 액체로 이루어지는 석재와 같은 물질. 
액체였다가 고체가 되고, 돌은 아니지만 돌과 유사해진 재료. 

빠져나오지 못한 아주 작은 공기가,
흐르고 싶은 대로 흐르다가 정지한 물결이,
회색과 회색 언저리로 번지는 색들이,
미세한 진동이 만든 섬세한 노이즈가
충분한 시간을 보내고 나면 그대로 남는다.

흔적과 자국과 흉터와 찰나를 그대로 남기는 
솔직함과 용기, 그리고 어쩔 수 없음.

미숙하고 불완전하다는 점에서 인간과 닮은 재료, 콘크리트. 
차갑게 굳어가는 시간의 중간에 가만히 손을 대보면 콘크리트는 사람좋게 따뜻하다. 
물과 돌의 먼 친척들이 서로 깍지를 끼고 뭉쳐있어서 무겁다. 
굳은 뒤 마주하면 낯설다가도 곧 친해지고 싶은 얼굴을 하고 있다. 

몰래 숨겨놓은 지문이나 손가락으로 꼬옥 누른 힘, 
내 만족과 아쉬움까지 콘크리트는 모두 그리고 기꺼이 간직해주었다.
    
    
    
    `,
  }
};

noteData["note04"] = {
  title: "나의 사랑하는 생활",
  date: "2024.08",
  body: `

  

`
};





const rows = document.querySelectorAll(".note__row");
const popup = document.getElementById("notePopup");
const popupClose = popup.querySelector(".notePopup__close");
const popupTitle = popup.querySelector(".notePopup__title");
const popupDate = popup.querySelector(".notePopup__date");
const popupBody = popup.querySelector(".notePopup__body");


rows.forEach(row => {
  row.addEventListener("click", () => {
    const key = row.dataset.note;
    const item = noteData[key];
    if (!item) return;

    popupTitle.textContent = item.title;
    popupDate.textContent = item.date;
    popupBody.textContent = item.body;

    popup.classList.add("show");
  });
});

popupClose.addEventListener("click", () => popup.classList.remove("show"));
popup.addEventListener("click", e => {
  if (e.target === popup) popup.classList.remove("show");
});
